{
  "Home": "Inicio",
  "About": "Sobre nosotros",
  "Services": "Servicios",
  "Contact": "Contacto",
  "Appointments": "Citas",
  "Call Us": "Llámanos",
  "Schedule Appointment": "Programar Cita",
  "Our Services": "Nuestros Servicios",
  "Dental Implants": "Implantes dentales",
  "Teeth Cleaning": "Limpieza dental",
  "Cosmetic Dentistry": "Odontología cosmética",
  "Root Canal": "Endodoncia",
  "Orthodontics": "Ortodoncia",
  "Emergency Care": "Atención de emergencia",
  "Welcome to Simple Dental": "Bienvenido a Simple Dental",
  "Quality dental care for the whole family": "Atención dental de calidad para toda la familia",
  "Years of Experience": "Años de experiencia",
  "Happy Patients": "Pacientes satisfechos",
  "Professional Staff": "Personal profesional",
  "Modern Equipment": "Equipo moderno",
  "Straightforward Dentistry from one Experienced Doctor.": "Odontología sencilla de un dentista experimentado.",
  "No pressure. No upsell. Just honest, transparent dental care with modern technology and fair pricing.": "Sin presión. Sin sobreventa. Solo atención dental honesta y transparente con tecnología moderna y precios justos.",
  "View Our Services": "Ver nuestros servicios",
  "Call (702) 302-4787": "Llamar (702) 302-4787",
  "What Simple Dental Stands For": "Lo que representa Simple Dental",
  "How We're Different": "Cómo somos diferentes",
  "One Doctor, Always": "Un doctor, siempre",
  "Transparent Pricing": "Precios transparentes",
  "Modern Efficiency": "Eficiencia moderna",
  "No Pressure": "Sin presión",
  "Our Most Popular Services": "Nuestros servicios más populares",
  "Visit Us in Las Vegas": "Visítanos en Las Vegas",
  "Our Location": "Nuestra ubicación",
  "Office Hours": "Horario de atención"
  ,
  "Straightforward dentistry from one experienced doctor. No pressure. No upsell.": "Odontología directa de un doctor experimentado. Sin presión. Sin ventas adicionales.",
  "Modern care with transparent pricing and honest approach to dental health.": "Atención moderna con precios transparentes y un enfoque honesto hacia la salud dental.",
  "Address:": "Dirección:",
  "Monday - Friday:": "Lunes - Viernes:",
  "Saturday & Sunday:": "Sábado y Domingo:",
  "Closed": "Cerrado",
  "Common Questions": "Preguntas frecuentes",
  "Do you accept insurance?": "¿Aceptan seguros?",
  "We accept most major insurance plans and will verify your benefits.": "Aceptamos la mayoría de los planes de seguro y verificaremos sus beneficios.",
  "One doctor, always?": "¿Un solo doctor, siempre?",
  "Yes, you'll see the same experienced doctor every visit.": "Sí, verá al mismo doctor experimentado en cada visita.",
  "All rights reserved.": "Todos los derechos reservados.",
  "At Simple Dental, we believe dentistry shouldn't be confusing or pushy. You'll always see the same dentist — me — and we'll only recommend what you truly need.": "En Simple Dental, creemos que la odontología no debe ser confusa ni agresiva. Siempre verá al mismo dentista —yo— y solo recomendaremos lo que realmente necesita.",
  "With digital tools and efficient systems, we make your visit fast, comfortable, and transparent. This isn't about fancy amenities or high-pressure sales — it's about delivering honest, quality dental care that working families can afford.": "Con herramientas digitales y sistemas eficientes, hacemos su visita rápida, cómoda y transparente. No se trata de lujos ni ventas agresivas — se trata de ofrecer atención dental honesta y de calidad que las familias trabajadoras pueden pagar.",
  "Learn More About Our Practice": "Conozca Más Sobre Nuestra Clínica",
  "Start Your Journey to Better Oral Health": "Comience su Camino hacia una Mejor Salud Oral",
  "New to Simple Dental? We're offering a comprehensive introduction to our practice.": "¿Nuevo en Simple Dental? Ofrecemos una introducción completa a nuestra clínica.",
  "Transparent pricing on the services our patients need most": "Precios transparentes en los servicios que nuestros pacientes más necesitan",
  "No surprises. No hidden fees.": "Sin sorpresas. Sin cargos ocultos.",
  "Patients know upfront what to expect.": "Los pacientes saben de antemano qué esperar.",
  "View All Services & Pricing": "Ver Todos los Servicios y Precios",
  "Convenient location with easy parking": "Ubicación conveniente con estacionamiento fácil",
  "Monday - Friday": "Lunes - Viernes",
  "Weekends:": "Fines de semana:",
  "Call to schedule your visit": "Llame para programar su visita",
  "Contact Us": "Contáctenos",
  "About Simple Dental": "Acerca de Simple Dental",
  "Straightforward dentistry you can trust": "Odontología directa en la que puede confiar",
  "Meet Dr. Charles Chang": "Conozca al Dr. Charles Chang",
  "Dr. Charles Chang is a highly experienced and trusted dentist who believes that dental care should be simple, honest, and stress-free. With over 15 years of clinical experience, Dr. Chang has advanced training in implants, oral surgery, endodontics, and same-day crowns. He takes pride in offering essential, high-quality treatments without unnecessary upselling or surprises.": "El Dr. Charles Chang es un dentista muy experimentado y de confianza que cree que la atención dental debe ser simple, honesta y sin estrés. Con más de 15 años de experiencia clínica, el Dr. Chang tiene formación avanzada en implantes, cirugía oral, endodoncia y coronas en el mismo día. Se enorgullece de ofrecer tratamientos esenciales y de alta calidad sin ventas innecesarias ni sorpresas.",
  "After practicing in New York and Seattle, Dr. Chang and his family moved to Las Vegas to build Simple Dental, a modern, patient-focused practice designed to make dental visits easier and more comfortable. His practice philosophy emphasizes efficiency, transparency, and respect for patients' time — including convenient same-day crowns and clear, upfront pricing.": "Después de ejercer en Nueva York y Seattle, el Dr. Chang y su familia se mudaron a Las Vegas para construir Simple Dental, una clínica moderna centrada en el paciente diseñada para hacer las visitas dentales más fáciles y cómodas. Su filosofía pone énfasis en la eficiencia, la transparencia y el respeto por el tiempo del paciente — incluyendo coronas en el mismo día y precios claros y por adelantado.",
  "Outside of the office, Dr. Chang enjoys spending time with his wife and daughter, exploring local parks and restaurants, and caring for their two dogs. As a dedicated father and family man, he understands the importance of balance and brings that same thoughtful, caring approach to each patient he treats.": "Fuera del consultorio, el Dr. Chang disfruta pasar tiempo con su esposa e hija, explorar parques y restaurantes locales y cuidar de sus dos perros. Como padre dedicado y hombre de familia, entiende la importancia del equilibrio y aporta ese mismo enfoque atento y cuidadoso a cada paciente que atiende.",
  "Dr. Chang looks forward to welcoming you to Simple Dental, where you can expect straightforward, compassionate care in a warm and welcoming environment.": "El Dr. Chang espera darle la bienvenida a Simple Dental, donde puede esperar una atención directa y compasiva en un ambiente cálido y acogedor.",
  "The Simple Dental Difference": "La Diferencia de Simple Dental",
  "Lean & Efficient": "Ágil y Eficiente",
  "Our practice is designed to be efficient with 2-3 operatories and advanced digital tools. This keeps overhead low and passes savings to you.": "Nuestra clínica está diseñada para ser eficiente con 2-3 operatorios y herramientas digitales avanzadas. Esto mantiene bajos los costos y transfiere los ahorros a usted.",
  "In-House Lab": "Laboratorio Interno",
  "Same-day crowns and faster turnaround times thanks to our in-house lab and digital workflow.": "Coronas en el mismo día y tiempos de entrega más rápidos gracias a nuestro laboratorio interno y flujo de trabajo digital.",
  "Mobile Delivery": "Sistema Móvil",
  "ASI mobile carts and modern systems make treatments more comfortable and efficient.": "Los carros móviles ASI y los sistemas modernos hacen que los tratamientos sean más cómodos y eficientes.",
  "Family Focused": "Enfocado en la Familia",
  "We cater to everyday working families who want honest, affordable care from an experienced doctor.": "Atendemos a familias trabajadoras que desean una atención honesta y asequible de un doctor experimentado.",
  "Coming to Las Vegas": "Próximamente en Las Vegas",
  "🚗 We're seconds away from Highway 95!": "🚗 ¡Estamos a segundos de la Autopista 95!",
  "Simple Dental is conveniently located just off Highway 95 at the Jones exit — you'll be at our door in seconds! Whether you're coming from Summerlin, Centennial Hills, or central Las Vegas, getting here is quick and easy.": "Simple Dental está convenientemente ubicado justo a la salida de la Autopista 95 en la salida de Jones — ¡llegará a nuestra puerta en segundos! Venga de Summerlin, Centennial Hills o del centro de Las Vegas, llegar es rápido y fácil.",
  "Look for us right off Jones Blvd, and enjoy stress-free parking and easy access — because your visit should start simple before you even step inside.": "Encuéntrenos justo en Jones Blvd y disfrute de estacionamiento sin estrés y acceso fácil — porque su visita debe empezar simple antes de entrar.",
  "Contact Simple Dental": "Contactar a Simple Dental",
  "Get in touch to schedule your appointment": "Póngase en contacto para programar su cita",
  "Schedule an Appointment": "Programar una Cita",
  "Phone": "Teléfono",
  "Best Times to Call": "Mejores Horas para Llamar",
  "Monday - Friday: 8:00 AM - 4:00 PM": "Lunes - Viernes: 8:00 AM - 4:00 PM",
  "Call Now": "Llamar Ahora",
  "Address": "Dirección",
  "🚗 Easy Access from Highway 95": "🚗 Acceso fácil desde la Autopista 95",
  "Just off Highway 95 at the Jones exit — you'll be at our door in seconds! Convenient for Summerlin, Centennial Hills, and central Las Vegas.": "Justo a la salida de la Autopista 95 en la salida Jones — ¡llegará a nuestra puerta en segundos! Conveniente para Summerlin, Centennial Hills y el centro de Las Vegas.",
  "Opening": "Apertura",
  "Weekends": "Fines de semana",
  "Send Us a Message": "Envíenos un Mensaje",
  "Have questions about our services or want to learn more? Send us a message and we'll get back to you soon.": "¿Tiene preguntas sobre nuestros servicios o quiere saber más? Envíenos un mensaje y nos comunicaremos pronto.",
  "Find Us in Las Vegas": "Encuéntrenos en Las Vegas",
  "Stay tuned for updates — we can't wait to welcome you soon!": "Manténgase al tanto de las novedades — ¡no podemos esperar para darle la bienvenida pronto!",
  "Frequently Asked Questions": "Preguntas Frecuentes",
  "When do you open?": "¿Cuándo abren?",
  "How do I schedule an appointment?": "¿Cómo programo una cita?",
  "Is parking available?": "¿Hay estacionamiento disponible?",
  "Yes, we'll have convenient parking available at our S Jones Blvd location.": "Sí, tendremos estacionamiento conveniente disponible en nuestra ubicación de S Jones Blvd.",
  "Security verification failed. Please refresh and try again.": "La verificación de seguridad falló. Actualice e inténtelo de nuevo.",
  "Name is required.": "El nombre es obligatorio.",
  "Valid email is required.": "Se requiere un correo electrónico válido.",
  "Message is required.": "El mensaje es obligatorio.",
  "Please complete the CAPTCHA verification.": "Por favor complete la verificación CAPTCHA.",
  "Thank you! Your message has been received. We'll get back to you within 24 hours.": "¡Gracias! Hemos recibido su mensaje. Nos pondremos en contacto en 24 horas.",
  "Contact Form Submission": "Envío de Formulario de Contacto",
  "New contact form submission from Simple Dental website:": "Nueva solicitud del formulario de contacto del sitio web de Simple Dental:",
  "Name:": "Nombre:",
  "Email:": "Correo electrónico:",
  "Phone:": "Teléfono:",
  "Message:": "Mensaje:",
  "Thank you! Your message has been sent successfully. We'll get back to you within 24 hours.": "¡Gracias! Su mensaje ha sido enviado con éxito. Nos pondremos en contacto en 24 horas.",
  "Sorry, there was an error sending your message. Please try one of these alternatives:": "Lo sentimos, hubo un error al enviar su mensaje. Por favor intente una de estas alternativas:",
  "Call us directly at (702) 302-4787": "Llámenos directamente al (702) 302-4787",
  "Email us at": "Envíenos un correo a",
  "Your Name*": "Su Nombre*",
  "Your Email*": "Su Correo*",
  "Your Phone Number": "Su Número de Teléfono",
  "Your Message*": "Su Mensaje*",
  "Send Message": "Enviar Mensaje",
  "Sending...": "Enviando...",
  "Required fields": "Campos obligatorios",
  "We respect your privacy and will never share your information.": "Respetamos su privacidad y nunca compartiremos su información.",
  "Thank you!": "¡Gracias!",
  "Please correct the following:": "Por favor corrija lo siguiente:",
  "An error occurred. Please try again.": "Ocurrió un error. Por favor, inténtelo de nuevo.",
  "Connection error. Please try again or call us directly at (702) 302-4787.": "Error de conexión. Inténtelo de nuevo o llámenos directamente al (702) 302-4787."
  ,
  "We'll provide details about insurance acceptance closer to our opening date. Our transparent pricing makes it easy to know costs upfront.": "Proporcionaremos detalles sobre la aceptación de seguros cerca de la fecha de apertura. Nuestros precios transparentes facilitan conocer los costos por adelantado.",
  "What makes you different?": "¿Qué los hace diferentes?",
  "You'll always see the same doctor, get transparent pricing, and receive only the care you actually need — no pressure, no upselling.": "Siempre verá al mismo doctor, tendrá precios transparentes y recibirá solo la atención que realmente necesita — sin presión ni ventas adicionales.",
  "What technology do you use?": "¿Qué tecnología utilizan?",
  "We use modern digital tools and equipment to make your visit more comfortable and efficient, including digital X-rays and intraoral scanners.": "Usamos herramientas y equipos digitales modernos para que su visita sea más cómoda y eficiente, incluyendo radiografías digitales y escáneres intraorales."
  ,
  "Read More": "Leer más",
  "Nothing Found": "Nada encontrado",
  "It looks like nothing was found at this location.": "Parece que no se encontró nada en esta ubicación.",
  "Go Home": "Ir al inicio",
  "New Patient Special": "Especial para nuevos pacientes",
  "Complete Checkup & Cleaning": "Chequeo completo y limpieza",
  "Comprehensive exam, professional cleaning, and peace of mind for new patients": "Examen integral, limpieza profesional y tranquilidad para nuevos pacientes",
  "Full Examination": "Examen completo",
  "Professional Cleaning": "Limpieza profesional",
  "X-rays if needed": "Radiografías si es necesario",
  "Book Your Visit": "Reserve su visita",
  "You'll see the same experienced dentist every visit. No rotating providers, no bait-and-switch.": "Verá al mismo dentista experimentado en cada visita. Sin rotación ni cambios engañosos.",
  "Know exactly what you'll pay before treatment begins. No surprise bills, no hidden fees.": "Sabrá exactamente cuánto pagará antes de iniciar el tratamiento. Sin facturas sorpresa ni cargos ocultos.",
  "Same-day crowns, digital technology, and streamlined systems for better outcomes.": "Coronas en el mismo día, tecnología digital y procesos optimizados para mejores resultados.",
  "We recommend only what you truly need. Just honest recommendations based on your dental health.": "Recomendamos solo lo que realmente necesita: sugerencias honestas basadas en su salud dental.",
  "Opening October 2025 | Las Vegas, Nevada": "Apertura en octubre de 2025 | Las Vegas, Nevada",
  "🎉 Opening October 2025!": "🎉 Apertura en octubre de 2025",
  "🎉 Coming October 2025! | Modern Dental Care in Las Vegas": "🎉 Llega en octubre de 2025 | Cuidado dental moderno en Las Vegas",
  "We're excited to announce that Simple Dental will be opening in October. Our brand-new, modern office is designed to make your dental visits simple, honest, and stress-free.": "Nos complace anunciar que Simple Dental abrirá en octubre. Nuestro consultorio nuevo y moderno está diseñado para que sus visitas dentales sean simples, honestas y sin estrés.",
  "Call us to learn more about our approach or to get on our list for October 2025.": "Llámenos para conocer más sobre nuestro enfoque o para unirse a nuestra lista para octubre de 2025.",
  "October 2025": "Octubre de 2025",
  "We're opening in October 2025 at our new location on S Jones Blvd.": "Abrimos en octubre de 2025 en nuestra nueva ubicación en S Jones Blvd.",
  "Call us at (702) 302-4787. We'll be taking appointments starting in October 2025.": "Llámenos al (702) 302-4787. Comenzaremos a tomar citas a partir de octubre de 2025."
  ,
  "Ready to Experience Simple Dental?": "¿Desea conocer Simple Dental?",
  "Advanced digital technology": "Tecnología digital avanzada",
  "Digital X-rays and tools": "Radiografías y herramientas digitales",
  "Comfortable, modern facility": "Instalaciones modernas y cómodas",
  "Easy parking and access": "Estacionamiento y acceso fáciles",
  "New Patient Exam + X-rays": "Examen para nuevo paciente + radiografías",
  "Adult Cleaning": "Limpieza dental para adultos",
  "Tooth-Colored Filling": "Empaste del color del diente",
  "Same-Day Crown (Ceramic)": "Corona en el mismo día (cerámica)",
  "Simple Extraction": "Extracción simple",
  "Front Tooth Root Canal": "Endodoncia de diente anterior",
  "Comprehensive initial examination with digital X-rays": "Examen inicial integral con radiografías digitales",
  "Professional teeth cleaning and polishing": "Limpieza dental profesional y pulido",
  "Composite fillings depending on surfaces treated": "Empastes de resina compuesta según caras tratadas",
  "Complete crown restoration in one visit": "Restauración completa de corona en una sola visita",
  "Routine tooth removal procedure": "Procedimiento rutinario de extracción dental",
  "Root canal therapy for anterior teeth": "Tratamiento de conducto para dientes anteriores",
  "Transparent pricing for all your dental care needs — no surprises, no hidden fees": "Precios transparentes para todas sus necesidades dentales — sin sorpresas ni cargos ocultos",
  "🦷 Same-Day Crowns with Cutting-Edge Technology": "🦷 Coronas en el mismo día con tecnología de vanguardia",
  "Experience the future of dental care with our advanced same-day crown technology. What traditionally required multiple visits, temporary crowns, and goopy impressions can now be completed in a single, comfortable appointment.": "Experimente el futuro de la odontología con nuestra tecnología de coronas en el mismo día. Lo que antes requería varias visitas, coronas temporales e impresiones pastosas ahora se completa en una sola cita, de forma cómoda.",
  "Advanced Intraoral Scanner": "Escáner intraoral avanzado",
  "Our state-of-the-art intraoral scanner captures precise 3D digital impressions in minutes. No more uncomfortable goopy impressions that make you gag — just a small wand that creates a perfect digital model of your tooth.": "Nuestro escáner intraoral de última generación captura impresiones digitales 3D precisas en minutos. Sin impresiones pastosas e incómodas que provocan arcadas: solo una pequeña sonda que crea un modelo digital perfecto de su diente.",
  "Comfortable, non-invasive scanning process": "Proceso de escaneo cómodo y no invasivo",
  "Precise measurements for perfect crown fit": "Mediciones precisas para un ajuste perfecto de la corona",
  "Real-time 3D visualization of your tooth": "Visualización 3D en tiempo real de su diente",
  "Glidewell Fastmill.io System": "Sistema Glidewell Fastmill.io",
  "Using Glidewell's Fastmill.io technology, we design and mill your custom crown right here in our office. This cutting-edge system ensures precision craftsmanship and perfect color matching for natural-looking results.": "Con la tecnología Fastmill.io de Glidewell, diseñamos y fresamos su corona personalizada aquí mismo en la clínica. Este sistema de vanguardia garantiza precisión en la fabricación y una correspondencia perfecta de color para resultados naturales.",
  "Crown designed and created in our office": "Corona diseñada y fabricada en nuestra clínica",
  "Perfect color and shape matching": "Correspondencia perfecta de color y forma",
  "High-strength ceramic materials": "Materiales cerámicos de alta resistencia",
  "Same-day placement and completion": "Colocación y terminación el mismo día",
  "The Same-Day Crown Advantage": "Ventajas de la corona en el mismo día",
  "Single Appointment": "Una sola cita",
  "Complete restoration in one visit — no second appointment needed": "Restauración completa en una sola visita — sin segunda cita",
  "No Temporary Crowns": "Sin coronas temporales",
  "Skip the discomfort and inconvenience of temporary crowns": "Evite la molestia y el inconveniente de las coronas temporales",
  "No Goopy Impressions": "Sin impresiones pastosas",
  "Digital scanning eliminates messy, uncomfortable impressions": "El escaneo digital elimina impresiones desordenadas e incómodas",
  "Perfect Precision": "Precisión perfecta",
  "Digital technology ensures accurate fit and natural appearance": "La tecnología digital asegura un ajuste preciso y una apariencia natural",
  "Experience Modern Dental Care": "Experimente la odontología moderna",
  "Ready to see how advanced technology makes dental care more comfortable and efficient? Our same-day crown process typically takes 2-3 hours from start to finish.": "¿Quiere ver cómo la tecnología avanzada hace la atención dental más cómoda y eficiente? Nuestro proceso de coronas en el mismo día suele durar 2–3 horas de principio a fin.",
  "Schedule Your Same-Day Crown Consultation": "Agende su consulta para corona en el mismo día",
  "Complete Service Menu": "Menú completo de servicios",
  "At Simple Dental, we believe you should know exactly what you're paying for. Below are our transparent prices for all dental procedures we offer. No games, no hidden fees — just honest pricing from an experienced doctor.": "En Simple Dental creemos que debe saber exactamente por qué paga. A continuación encontrará nuestros precios transparentes para todos los procedimientos. Sin trucos ni cargos ocultos — solo precios honestos de un dentista experimentado.",
  "💡 Transparent Pricing Notice": "💡 Aviso de precios transparentes",
  "The prices listed on our website are our cash fees, designed for patients without dental insurance or those who prefer to pay directly.": "Los precios publicados en nuestro sitio son tarifas en efectivo, destinadas a pacientes sin seguro dental o que prefieren pagar directamente.",
  "If you have dental insurance and we are in-network, your cost will be determined by your specific insurance plan's benefits and contracted rates.": "Si tiene seguro dental y somos proveedores dentro de su red, su costo dependerá de los beneficios y tarifas contratadas de su plan.",
  "If we are out-of-network with your insurance, we are happy to help you submit claims to your insurance company to maximize your reimbursement.": "Si estamos fuera de su red, con gusto le ayudaremos a presentar reclamaciones para maximizar su reembolso.",
  "Our team is always available to help you understand your coverage and provide an estimate before treatment, so there are no surprises.": "Nuestro equipo siempre está disponible para ayudarle a entender su cobertura y proporcionar un presupuesto antes del tratamiento, para que no haya sorpresas.",
  "Efficient Digital Workflow": "Flujo digital eficiente",
  "Our streamlined digital systems and in-house lab capabilities mean faster treatment times and better outcomes for our patients.": "Nuestros sistemas digitales optimizados y el laboratorio interno implican tiempos de tratamiento más rápidos y mejores resultados.",
  "Transparent Treatment Planning": "Planificación de tratamiento transparente",
  "We explain every step of your treatment and provide clear pricing upfront. No surprises, no hidden costs.": "Explicamos cada paso de su tratamiento y ofrecemos precios claros por adelantado. Sin sorpresas ni costos ocultos.",
  "Honest Recommendations": "Recomendaciones honestas",
  "We only recommend treatments you truly need. Our focus is on preserving your natural teeth whenever possible.": "Solo recomendamos los tratamientos que realmente necesita. Nuestro enfoque es preservar sus dientes naturales siempre que sea posible.",
  "Ready to Schedule Your Visit?": "¿Listo para programar su visita?",
  "Call us today to discuss your dental needs and schedule an appointment. We're here to provide honest, affordable care.": "Llámenos hoy para conversar sobre sus necesidades dentales y programar una cita. Estamos aquí para ofrecer una atención honesta y asequible.",
  "Get More Information": "Más información"
  ,
  "Preventive & Diagnostic": "Preventivo y diagnóstico",
  "Routine Exam + 4 X-rays": "Examen de rutina + 4 radiografías",
  "Deep Cleaning (per quadrant)": "Limpieza profunda (por cuadrante)",
  "Fluoride Treatment": "Tratamiento con flúor",
  "Regular checkup with limited X-ray series": "Chequeo regular con serie limitada de radiografías",
  "Deep scaling and root planing treatment": "Raspado y alisado radicular profundo",
  "Professional fluoride application for cavity prevention": "Aplicación profesional de flúor para prevenir caries",
  "Restorative Dentistry": "Odontología restauradora",
  "Core Buildup (if needed)": "Núcleo de reconstrucción (si es necesario)",
  "Foundation preparation for crown placement": "Preparación de la base para colocación de corona",
  "Tooth Removal": "Extracción dental",
  "Surgical Extraction": "Extracción quirúrgica",
  "Complex tooth removal requiring surgical technique": "Extracción compleja que requiere técnica quirúrgica",
  "Root Canals": "Endodoncias",
  "Front Tooth": "Diente anterior",
  "Premolar": "Premolar",
  "Molar": "Molar",
  "Root canal therapy for bicuspid teeth": "Terapia de conducto para premolares",
  "Root canal therapy for back teeth": "Terapia de conducto para molares",
  "Dentures & Partials": "Dentaduras y parciales",
  "Full Denture (per arch)": "Dentadura completa (por arcada)",
  "Partial Denture": "Prótesis parcial",
  "Denture Reline": "Rebase de dentadura",
  "Complete denture for upper or lower jaw": "Dentadura completa para maxilar o mandíbula",
  "Removable partial denture to replace missing teeth": "Prótesis parcial removible para reemplazar dientes ausentes",
  "Adjusting denture fit for comfort": "Ajuste de la dentadura para mayor comodidad",
  "Other Services": "Otros servicios",
  "Night Guard": "Férula nocturna",
  "Retainers (per arch)": "Retenedores (por arcada)",
  "Custom-made night guard for teeth grinding protection": "Férula a medida para protección contra el bruxismo",
  "Custom retainers for maintaining tooth position": "Retenedores a medida para mantener la posición dentaria"
}
